In [1]:
import pandas as pd
import numpy as np

In [9]:


# Since we will be working with ratings（评级）, we will set the precision（精度） of our 
# dataframes to one decimal place.
pd.set_option('precision', 1)

# Create a Pandas DataFrame that contains the ratings some users have given to a
# series of books. The ratings given are in the range from 1 to 5, with 5 being
# the best score. The names of the books, the authors, and the ratings of each user
# are given below:

books = pd.Series(data = ['Great Expectations', 'Of Mice and Men', 'Romeo and Juliet', 'The Time Machine', 'Alice in Wonderland' ])
authors = pd.Series(data = ['Charles Dickens', 'John Steinbeck', 'William Shakespeare', ' H. G. Wells', 'Lewis Carroll' ])

user_1 = pd.Series(data = [3.2, np.nan ,2.5])
user_2 = pd.Series(data = [5., 1.3, 4.0, 3.8])
user_3 = pd.Series(data = [2.0, 2.3, np.nan, 4])
user_4 = pd.Series(data = [4, 3.5, 4, 5, 4.2])

In [13]:
# Users that have np.nan values means that the user has not yet rated that book.
# Use the data above to create a Pandas DataFrame that has the following column
# labels: 'Author', 'Book Title', 'User 1', 'User 2', 'User 3', 'User 4'. Let Pandas
# automatically assign numerical row indices to the DataFrame. 

# Create a dictionary with the data given above
# dat = 

items = {'books' : books, 
         'authors' : authors,
         'User1':user_1,
         'User2':user_2,
         'User3':user_3,
         'User4':user_2}

创建df可以通过字典的方式创建

In [18]:
# Use the dictionary to create a Pandas DataFrame
# book_ratings = 
book_ratings=pd.DataFrame(items)
book_ratings

   User1  User2  User3  User4              authors                books
0    3.2    5.0    2.0    5.0      Charles Dickens   Great Expectations
1    NaN    1.3    2.3    1.3       John Steinbeck      Of Mice and Men
2    2.5    4.0    NaN    4.0  William Shakespeare     Romeo and Juliet
3    NaN    3.8    4.0    3.8          H. G. Wells     The Time Machine
4    NaN    NaN    NaN    NaN        Lewis Carroll  Alice in Wonderland

In [11]:
# If you created the dictionary correctly you should have a Pandas DataFrame
# that has column labels: 'Author', 'Book Title', 'User 1', 'User 2', 'User 3',
# 'User 4' and row indices 0 through 4.

In [21]:
# Now replace all the NaN values in your DataFrame with the average rating in
# each column. Replace the NaN values in place. HINT: you can use the fillna()
# function with the keyword inplace = True, to do this. Write your code below:

# book_ratings.interpolate(method = 'linear', axis = 1)

book_ratings.fillna(book_ratings.mean())

   User1  User2  User3  User4              authors                books
0    3.2    5.0    2.0    5.0      Charles Dickens   Great Expectations
1    2.9    1.3    2.3    1.3       John Steinbeck      Of Mice and Men
2    2.5    4.0    2.8    4.0  William Shakespeare     Romeo and Juliet
3    2.9    3.8    4.0    3.8          H. G. Wells     The Time Machine
4    2.9    3.5    2.8    3.5        Lewis Carroll  Alice in Wonderland

In [22]:
book_ratings.isnull()

   User1  User2  User3  User4  authors  books
0  False  False  False  False    False  False
1   True  False  False  False    False  False
2  False  False   True  False    False  False
3   True  False  False  False    False  False
4   True   True   True   True    False  False

你可以从上述 DataFrame 中选择评分为 5 的所有图书了，一行代码就能搞定

In [24]:
book_ratings[(book_ratings == 5).any(axis = 1)]['books'].values

array(['Great Expectations'], dtype=object)

取出满足条件的第一行

In [30]:
book_ratings[(book_ratings == 5).any(axis=1)]

   User1  User2  User3  User4          authors               books
0    3.2    5.0    2.0    5.0  Charles Dickens  Great Expectations

In [32]:
book_ratings==5

   User1  User2  User3  User4  authors  books
0  False   True  False   True    False  False
1  False  False  False  False    False  False
2  False  False  False  False    False  False
3  False  False  False  False    False  False
4  False  False  False  False    False  False

在dataframe中，any为df中一列或一行，只要有一个满足（都满足）

In [33]:
(book_ratings == 5).any(axis=1)

0     True
1    False
2    False
3    False
4    False
dtype: bool

In [37]:
# (book_ratings == 5).all(axis=1)

In [34]:
(book_ratings == 5).any(axis=0)

User1      False
User2       True
User3      False
User4       True
authors    False
books      False
dtype: bool

In [35]:
book_ratings

   User1  User2  User3  User4              authors                books
0    3.2    5.0    2.0    5.0      Charles Dickens   Great Expectations
1    NaN    1.3    2.3    1.3       John Steinbeck      Of Mice and Men
2    2.5    4.0    NaN    4.0  William Shakespeare     Romeo and Juliet
3    NaN    3.8    4.0    3.8          H. G. Wells     The Time Machine
4    NaN    NaN    NaN    NaN        Lewis Carroll  Alice in Wonderland